Repository: dozenplusone/linux-dev
Catalog: 11_Documenting/po/*.po
Languages: ru

source: Usage: %s [-r | -h | --help | -v | --version] Guess a picked number. -r print numerals in Roman -h, --help display this help and exit -v, --version output version information and exit
ru: Использование: %s [-r | -h | --help | -v | --version] Отгадает задуманное число. -r печатать числа римскими цифрами -h, --help показать эту справку и выйти -v, --version показать информацию о версии и выйти

source: %1$s: invalid option -- '%2$s' Try '%1$s --help' for more information.
ru: %1$s: неверный ключ — «%2$s» По команде «%1$s --help» можно получить дополнительную информацию.

source: Pick a natural number between %s and %s and press Enter.
ru: Загадайте натуральное число от %s до %s и нажмите Enter.

source: Pick a natural number between %d and %d and press Enter.
ru: Загадайте натуральное число от %d до %d и нажмите Enter.

source: Is the number not greater than %s? [yes/no]
ru: Число не превосходит %s? [да/нет]

source: Is the number not greater than %d? [yes/no]
ru: Число не превосходит %d? [да/нет]

source: yes
ru: да

source: no
ru: нет

source: The answer is %s.
ru: Ответ: %s.

source: The answer is %d.
ru: Ответ: %d.
